---
kind: other
id: Properties.T:Autodesk.Revit.DB.ModelCurve
source: html/23a29ad6-b4f8-f12b-8f9d-2c1b9458eb32.htm
---
# ModelCurve Properties

The id of the assembly instance to which the element belongs.